Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/hemc.h
/* -------- HEMC_CR_NCS3 : (HEMC Offset: 0x0C) (R/W 32) HEMC Control Register NCS 3 -------- */
#define HEMC_CR_NCS3_ZERO_Pos                 _U_(0)                                               /**< (HEMC_CR_NCS3) fixed to 0 Position */
#define HEMC_CR_NCS3_ZERO_Msk                 (_U_(0x1) << HEMC_CR_NCS3_ZERO_Pos)                  /**< (HEMC_CR_NCS3) fixed to 0 Mask */
#define HEMC_CR_NCS3_ZERO(value)              (HEMC_CR_NCS3_ZERO_Msk & ((value) << HEMC_CR_NCS3_ZERO_Pos))
#define HEMC_CR_NCS3_BANKSIZE_Pos             _U_(1)                                               /**< (HEMC_CR_NCS3) Bank Size Position */
#define HEMC_CR_NCS3_BANKSIZE_Msk             (_U_(0x1F) << HEMC_CR_NCS3_BANKSIZE_Pos)             /**< (HEMC_CR_NCS3) Bank Size Mask */
#define HEMC_CR_NCS3_BANKSIZE(value)          (HEMC_CR_NCS3_BANKSIZE_Msk & ((value) << HEMC_CR_NCS3_BANKSIZE_Pos))
#define   HEMC_CR_NCS3_BANKSIZE_8KB_Val       _U_(0x0)                                             /**< (HEMC_CR_NCS3) 8Kbytes  */
#define   HEMC_CR_NCS3_BANKSIZE_16KB_Val      _U_(0x1)                                             /**< (HEMC_CR_NCS3) 16Kbytes  */
#define   HEMC_CR_NCS3_BANKSIZE_32KB_Val      _U_(0x2)                                             /**< (HEMC_CR_NCS3) 32Kbytes  */
#define   HEMC_CR_NCS3_BANKSIZE_64KB_Val      _U_(0x3)                                             /**< (HEMC_CR_NCS3) 64Kbytes  */
#define   HEMC_CR_NCS3_BANKSIZE_128KB_Val     _U_(0x4)                                             /**< (HEMC_CR_NCS3) 128Kbytes  */
#define   HEMC_CR_NCS3_BANKSIZE_256KB_Val     _U_(0x5)                                             /**< (HEMC_CR_NCS3) 256Kbytes  */
#define   HEMC_CR_NCS3_BANKSIZE_512KB_Val     _U_(0x6)                                             /**< (HEMC_CR_NCS3) 512Kbytes  */
#define   HEMC_CR_NCS3_BANKSIZE_1MB_Val       _U_(0x7)                                             /**< (HEMC_CR_NCS3) 1Mbytes  */
#define   HEMC_CR_NCS3_BANKSIZE_2MB_Val       _U_(0x8)                                             /**< (HEMC_CR_NCS3) 2Mbytes  */
#define   HEMC_CR_NCS3_BANKSIZE_4MB_Val       _U_(0x9)                                             /**< (HEMC_CR_NCS3) 4Mbytes  */
#define   HEMC_CR_NCS3_BANKSIZE_8MB_Val       _U_(0xA)                                             /**< (HEMC_CR_NCS3) 8Mbytes  */
#define   HEMC_CR_NCS3_BANKSIZE_16MB_Val      _U_(0xB)                                             /**< (HEMC_CR_NCS3) 16Mbytes  */
#define   HEMC_CR_NCS3_BANKSIZE_32MB_Val      _U_(0xC)                                             /**< (HEMC_CR_NCS3) 32Mbytes  */
#define   HEMC_CR_NCS3_BANKSIZE_64MB_Val      _U_(0xD)                                             /**< (HEMC_CR_NCS3) 64Mbytes  */
#define   HEMC_CR_NCS3_BANKSIZE_128MB_Val     _U_(0xE)                                             /**< (HEMC_CR_NCS3) 128Mbytes  */
#define   HEMC_CR_NCS3_BANKSIZE_256MB_Val     _U_(0xF)                                             /**< (HEMC_CR_NCS3) 256Mbytes (Default)  */
#define   HEMC_CR_NCS3_BANKSIZE_512MB_Val     _U_(0x10)                                            /**< (HEMC_CR_NCS3) 512Mbytes  */
#define   HEMC_CR_NCS3_BANKSIZE_NOT_USED_Val  _U_(0x1F)                                            /**< (HEMC_CR_NCS3) NOT_USED  */
#define HEMC_CR_NCS3_BANKSIZE_8KB             (HEMC_CR_NCS3_BANKSIZE_8KB_Val << HEMC_CR_NCS3_BANKSIZE_Pos) /**< (HEMC_CR_NCS3) 8Kbytes Position  */
#define HEMC_CR_NCS3_BANKSIZE_16KB            (HEMC_CR_NCS3_BANKSIZE_16KB_Val << HEMC_CR_NCS3_BANKSIZE_Pos) /**< (HEMC_CR_NCS3) 16Kbytes Position  */
#define HEMC_CR_NCS3_BANKSIZE_32KB            (HEMC_CR_NCS3_BANKSIZE_32KB_Val << HEMC_CR_NCS3_BANKSIZE_Pos) /**< (HEMC_CR_NCS3) 32Kbytes Position  */
#define HEMC_CR_NCS3_BANKSIZE_64KB            (HEMC_CR_NCS3_BANKSIZE_64KB_Val << HEMC_CR_NCS3_BANKSIZE_Pos) /**< (HEMC_CR_NCS3) 64Kbytes Position  */
#define HEMC_CR_NCS3_BANKSIZE_128KB           (HEMC_CR_NCS3_BANKSIZE_128KB_Val << HEMC_CR_NCS3_BANKSIZE_Pos) /**< (HEMC_CR_NCS3) 128Kbytes Position  */
#define HEMC_CR_NCS3_BANKSIZE_256KB           (HEMC_CR_NCS3_BANKSIZE_256KB_Val << HEMC_CR_NCS3_BANKSIZE_Pos) /**< (HEMC_CR_NCS3) 256Kbytes Position  */
#define HEMC_CR_NCS3_BANKSIZE_512KB           (HEMC_CR_NCS3_BANKSIZE_512KB_Val << HEMC_CR_NCS3_BANKSIZE_Pos) /**< (HEMC_CR_NCS3) 512Kbytes Position  */
#define HEMC_CR_NCS3_BANKSIZE_1MB             (HEMC_CR_NCS3_BANKSIZE_1MB_Val << HEMC_CR_NCS3_BANKSIZE_Pos) /**< (HEMC_CR_NCS3) 1Mbytes Position  */
#define HEMC_CR_NCS3_BANKSIZE_2MB             (HEMC_CR_NCS3_BANKSIZE_2MB_Val << HEMC_CR_NCS3_BANKSIZE_Pos) /**< (HEMC_CR_NCS3) 2Mbytes Position  */
#define HEMC_CR_NCS3_BANKSIZE_4MB             (HEMC_CR_NCS3_BANKSIZE_4MB_Val << HEMC_CR_NCS3_BANKSIZE_Pos) /**< (HEMC_CR_NCS3) 4Mbytes Position  */
#define HEMC_CR_NCS3_BANKSIZE_8MB             (HEMC_CR_NCS3_BANKSIZE_8MB_Val << HEMC_CR_NCS3_BANKSIZE_Pos) /**< (HEMC_CR_NCS3) 8Mbytes Position  */
#define HEMC_CR_NCS3_BANKSIZE_16MB            (HEMC_CR_NCS3_BANKSIZE_16MB_Val << HEMC_CR_NCS3_BANKSIZE_Pos) /**< (HEMC_CR_NCS3) 16Mbytes Position  */
#define HEMC_CR_NCS3_BANKSIZE_32MB            (HEMC_CR_NCS3_BANKSIZE_32MB_Val << HEMC_CR_NCS3_BANKSIZE_Pos) /**< (HEMC_CR_NCS3) 32Mbytes Position  */
#define HEMC_CR_NCS3_BANKSIZE_64MB            (HEMC_CR_NCS3_BANKSIZE_64MB_Val << HEMC_CR_NCS3_BANKSIZE_Pos) /**< (HEMC_CR_NCS3) 64Mbytes Position  */
#define HEMC_CR_NCS3_BANKSIZE_128MB           (HEMC_CR_NCS3_BANKSIZE_128MB_Val << HEMC_CR_NCS3_BANKSIZE_Pos) /**< (HEMC_CR_NCS3) 128Mbytes Position  */
#define HEMC_CR_NCS3_BANKSIZE_256MB           (HEMC_CR_NCS3_BANKSIZE_256MB_Val << HEMC_CR_NCS3_BANKSIZE_Pos) /**< (HEMC_CR_NCS3) 256Mbytes (Default) Position  */
#define HEMC_CR_NCS3_BANKSIZE_512MB           (HEMC_CR_NCS3_BANKSIZE_512MB_Val << HEMC_CR_NCS3_BANKSIZE_Pos) /**< (HEMC_CR_NCS3) 512Mbytes Position  */
#define HEMC_CR_NCS3_BANKSIZE_NOT_USED        (HEMC_CR_NCS3_BANKSIZE_NOT_USED_Val << HEMC_CR_NCS3_BANKSIZE_Pos) /**< (HEMC_CR_NCS3) NOT_USED Position  */
#define HEMC_CR_NCS3_TYPE_Pos                 _U_(6)                                               /**< (HEMC_CR_NCS3) type of memory used Position */
#define HEMC_CR_NCS3_TYPE_Msk                 (_U_(0x1) << HEMC_CR_NCS3_TYPE_Pos)                  /**< (HEMC_CR_NCS3) type of memory used Mask */
#define HEMC_CR_NCS3_TYPE(value)              (HEMC_CR_NCS3_TYPE_Msk & ((value) << HEMC_CR_NCS3_TYPE_Pos))
#define HEMC_CR_NCS3_ADDBASE_Pos              _U_(7)                                               /**< (HEMC_CR_NCS3) relative base address of NCS area Position */
#define HEMC_CR_NCS3_ADDBASE_Msk              (_U_(0x3FFFF) << HEMC_CR_NCS3_ADDBASE_Pos)           /**< (HEMC_CR_NCS3) relative base address of NCS area Mask */
#define HEMC_CR_NCS3_ADDBASE(value)           (HEMC_CR_NCS3_ADDBASE_Msk & ((value) << HEMC_CR_NCS3_ADDBASE_Pos))
#define HEMC_CR_NCS3_ECC_ENABLE_Pos           _U_(30)                                              /**< (HEMC_CR_NCS3) ECC Protection Enable Position */
#define HEMC_CR_NCS3_ECC_ENABLE_Msk           (_U_(0x1) << HEMC_CR_NCS3_ECC_ENABLE_Pos)            /**< (HEMC_CR_NCS3) ECC Protection Enable Mask */
#define HEMC_CR_NCS3_ECC_ENABLE(value)        (HEMC_CR_NCS3_ECC_ENABLE_Msk & ((value) << HEMC_CR_NCS3_ECC_ENABLE_Pos))
#define HEMC_CR_NCS3_ECC12_ENABLE_Pos         _U_(31)                                              /**< (HEMC_CR_NCS3) BCH ECC Enable Position */
#define HEMC_CR_NCS3_ECC12_ENABLE_Msk         (_U_(0x1) << HEMC_CR_NCS3_ECC12_ENABLE_Pos)          /**< (HEMC_CR_NCS3) BCH ECC Enable Mask */
#define HEMC_CR_NCS3_ECC12_ENABLE(value)      (HEMC_CR_NCS3_ECC12_ENABLE_Msk & ((value) << HEMC_CR_NCS3_ECC12_ENABLE_Pos))
#define HEMC_CR_NCS3_Msk                      _U_(0xC1FFFFFF)                                      /**< (HEMC_CR_NCS3) Register Mask  */


/* -------- HEMC_CR_NCS4 : (HEMC Offset: 0x10) (R/W 32) HEMC Control Register NCS 4 -------- */
#define HEMC_CR_NCS4_ZERO_Pos                 _U_(0)                                               /**< (HEMC_CR_NCS4) fixed to 0 Position */
#define HEMC_CR_NCS4_ZERO_Msk                 (_U_(0x1) << HEMC_CR_NCS4_ZERO_Pos)                  /**< (HEMC_CR_NCS4) fixed to 0 Mask */
#define HEMC_CR_NCS4_ZERO(value)              (HEMC_CR_NCS4_ZERO_Msk & ((value) << HEMC_CR_NCS4_ZERO_Pos))
#define HEMC_CR_NCS4_BANKSIZE_Pos             _U_(1)                                               /**< (HEMC_CR_NCS4) Bank Size Position */
#define HEMC_CR_NCS4_BANKSIZE_Msk             (_U_(0x1F) << HEMC_CR_NCS4_BANKSIZE_Pos)             /**< (HEMC_CR_NCS4) Bank Size Mask */
#define HEMC_CR_NCS4_BANKSIZE(value)          (HEMC_CR_NCS4_BANKSIZE_Msk & ((value) << HEMC_CR_NCS4_BANKSIZE_Pos))
#define   HEMC_CR_NCS4_BANKSIZE_8KB_Val       _U_(0x0)                                             /**< (HEMC_CR_NCS4) 8Kbytes  */
#define   HEMC_CR_NCS4_BANKSIZE_16KB_Val      _U_(0x1)                                             /**< (HEMC_CR_NCS4) 16Kbytes  */
#define   HEMC_CR_NCS4_BANKSIZE_32KB_Val      _U_(0x2)                                             /**< (HEMC_CR_NCS4) 32Kbytes  */
#define   HEMC_CR_NCS4_BANKSIZE_64KB_Val      _U_(0x3)                                             /**< (HEMC_CR_NCS4) 64Kbytes  */
#define   HEMC_CR_NCS4_BANKSIZE_128KB_Val     _U_(0x4)                                             /**< (HEMC_CR_NCS4) 128Kbytes  */
#define   HEMC_CR_NCS4_BANKSIZE_256KB_Val     _U_(0x5)                                             /**< (HEMC_CR_NCS4) 256Kbytes  */
#define   HEMC_CR_NCS4_BANKSIZE_512KB_Val     _U_(0x6)                                             /**< (HEMC_CR_NCS4) 512Kbytes  */
#define   HEMC_CR_NCS4_BANKSIZE_1MB_Val       _U_(0x7)                                             /**< (HEMC_CR_NCS4) 1Mbytes  */
#define   HEMC_CR_NCS4_BANKSIZE_2MB_Val       _U_(0x8)                                             /**< (HEMC_CR_NCS4) 2Mbytes  */
#define   HEMC_CR_NCS4_BANKSIZE_4MB_Val       _U_(0x9)                                             /**< (HEMC_CR_NCS4) 4Mbytes  */
#define   HEMC_CR_NCS4_BANKSIZE_8MB_Val       _U_(0xA)                                             /**< (HEMC_CR_NCS4) 8Mbytes  */
#define   HEMC_CR_NCS4_BANKSIZE_16MB_Val      _U_(0xB)                                             /**< (HEMC_CR_NCS4) 16Mbytes  */
#define   HEMC_CR_NCS4_BANKSIZE_32MB_Val      _U_(0xC)                                             /**< (HEMC_CR_NCS4) 32Mbytes  */
#define   HEMC_CR_NCS4_BANKSIZE_64MB_Val      _U_(0xD)                                             /**< (HEMC_CR_NCS4) 64Mbytes  */
#define   HEMC_CR_NCS4_BANKSIZE_128MB_Val     _U_(0xE)                                             /**< (HEMC_CR_NCS4) 128Mbytes  */
#define   HEMC_CR_NCS4_BANKSIZE_256MB_Val     _U_(0xF)                                             /**< (HEMC_CR_NCS4) 256Mbytes (Default)  */
#define   HEMC_CR_NCS4_BANKSIZE_512MB_Val     _U_(0x10)                                            /**< (HEMC_CR_NCS4) 512Mbytes  */
#define   HEMC_CR_NCS4_BANKSIZE_NOT_USED_Val  _U_(0x1F)                                            /**< (HEMC_CR_NCS4) NOT_USED  */
#define HEMC_CR_NCS4_BANKSIZE_8KB             (HEMC_CR_NCS4_BANKSIZE_8KB_Val << HEMC_CR_NCS4_BANKSIZE_Pos) /**< (HEMC_CR_NCS4) 8Kbytes Position  */
#define HEMC_CR_NCS4_BANKSIZE_16KB            (HEMC_CR_NCS4_BANKSIZE_16KB_Val << HEMC_CR_NCS4_BANKSIZE_Pos) /**< (HEMC_CR_NCS4) 16Kbytes Position  */
#define HEMC_CR_NCS4_BANKSIZE_32KB            (HEMC_CR_NCS4_BANKSIZE_32KB_Val << HEMC_CR_NCS4_BANKSIZE_Pos) /**< (HEMC_CR_NCS4) 32Kbytes Position  */
#define HEMC_CR_NCS4_BANKSIZE_64KB            (HEMC_CR_NCS4_BANKSIZE_64KB_Val << HEMC_CR_NCS4_BANKSIZE_Pos) /**< (HEMC_CR_NCS4) 64Kbytes Position  */
#define HEMC_CR_NCS4_BANKSIZE_128KB           (HEMC_CR_NCS4_BANKSIZE_128KB_Val << HEMC_CR_NCS4_BANKSIZE_Pos) /**< (HEMC_CR_NCS4) 128Kbytes Position  */
#define HEMC_CR_NCS4_BANKSIZE_256KB           (HEMC_CR_NCS4_BANKSIZE_256KB_Val << HEMC_CR_NCS4_BANKSIZE_Pos) /**< (HEMC_CR_NCS4) 256Kbytes Position  */
#define HEMC_CR_NCS4_BANKSIZE_512KB           (HEMC_CR_NCS4_BANKSIZE_512KB_Val << HEMC_CR_NCS4_BANKSIZE_Pos) /**< (HEMC_CR_NCS4) 512Kbytes Position  */
#define HEMC_CR_NCS4_BANKSIZE_1MB             (HEMC_CR_NCS4_BANKSIZE_1MB_Val << HEMC_CR_NCS4_BANKSIZE_Pos) /**< (HEMC_CR_NCS4) 1Mbytes Position  */
#define HEMC_CR_NCS4_BANKSIZE_2MB             (HEMC_CR_NCS4_BANKSIZE_2MB_Val << HEMC_CR_NCS4_BANKSIZE_Pos) /**< (HEMC_CR_NCS4) 2Mbytes Position  */
#define HEMC_CR_NCS4_BANKSIZE_4MB             (HEMC_CR_NCS4_BANKSIZE_4MB_Val << HEMC_CR_NCS4_BANKSIZE_Pos) /**< (HEMC_CR_NCS4) 4Mbytes Position  */
#define HEMC_CR_NCS4_BANKSIZE_8MB             (HEMC_CR_NCS4_BANKSIZE_8MB_Val << HEMC_CR_NCS4_BANKSIZE_Pos) /**< (HEMC_CR_NCS4) 8Mbytes Position  */
#define HEMC_CR_NCS4_BANKSIZE_16MB            (HEMC_CR_NCS4_BANKSIZE_16MB_Val << HEMC_CR_NCS4_BANKSIZE_Pos) /**< (HEMC_CR_NCS4) 16Mbytes Position  */
#define HEMC_CR_NCS4_BANKSIZE_32MB            (HEMC_CR_NCS4_BANKSIZE_32MB_Val << HEMC_CR_NCS4_BANKSIZE_Pos) /**< (HEMC_CR_NCS4) 32Mbytes Position  */
#define HEMC_CR_NCS4_BANKSIZE_64MB            (HEMC_CR_NCS4_BANKSIZE_64MB_Val << HEMC_CR_NCS4_BANKSIZE_Pos) /**< (HEMC_CR_NCS4) 64Mbytes Position  */
#define HEMC_CR_NCS4_BANKSIZE_128MB           (HEMC_CR_NCS4_BANKSIZE_128MB_Val << HEMC_CR_NCS4_BANKSIZE_Pos) /**< (HEMC_CR_NCS4) 128Mbytes Position  */
#define HEMC_CR_NCS4_BANKSIZE_256MB           (HEMC_CR_NCS4_BANKSIZE_256MB_Val << HEMC_CR_NCS4_BANKSIZE_Pos) /**< (HEMC_CR_NCS4) 256Mbytes (Default) Position  */
#define HEMC_CR_NCS4_BANKSIZE_512MB           (HEMC_CR_NCS4_BANKSIZE_512MB_Val << HEMC_CR_NCS4_BANKSIZE_Pos) /**< (HEMC_CR_NCS4) 512Mbytes Position  */
#define HEMC_CR_NCS4_BANKSIZE_NOT_USED        (HEMC_CR_NCS4_BANKSIZE_NOT_USED_Val << HEMC_CR_NCS4_BANKSIZE_Pos) /**< (HEMC_CR_NCS4) NOT_USED Position  */
#define HEMC_CR_NCS4_TYPE_Pos                 _U_(6)                                               /**< (HEMC_CR_NCS4) type of memory used Position */
#define HEMC_CR_NCS4_TYPE_Msk                 (_U_(0x1) << HEMC_CR_NCS4_TYPE_Pos)                  /**< (HEMC_CR_NCS4) type of memory used Mask */
#define HEMC_CR_NCS4_TYPE(value)              (HEMC_CR_NCS4_TYPE_Msk & ((value) << HEMC_CR_NCS4_TYPE_Pos))
#define HEMC_CR_NCS4_ADDBASE_Pos              _U_(7)                                               /**< (HEMC_CR_NCS4) relative base address of NCS area Position */
#define HEMC_CR_NCS4_ADDBASE_Msk              (_U_(0x3FFFF) << HEMC_CR_NCS4_ADDBASE_Pos)           /**< (HEMC_CR_NCS4) relative base address of NCS area Mask */
#define HEMC_CR_NCS4_ADDBASE(value)           (HEMC_CR_NCS4_ADDBASE_Msk & ((value) << HEMC_CR_NCS4_ADDBASE_Pos))
#define HEMC_CR_NCS4_ECC_ENABLE_Pos           _U_(30)                                              /**< (HEMC_CR_NCS4) ECC Protection Enable Position */
#define HEMC_CR_NCS4_ECC_ENABLE_Msk           (_U_(0x1) << HEMC_CR_NCS4_ECC_ENABLE_Pos)            /**< (HEMC_CR_NCS4) ECC Protection Enable Mask */
#define HEMC_CR_NCS4_ECC_ENABLE(value)        (HEMC_CR_NCS4_ECC_ENABLE_Msk & ((value) << HEMC_CR_NCS4_ECC_ENABLE_Pos))
#define HEMC_CR_NCS4_ECC12_ENABLE_Pos         _U_(31)                                              /**< (HEMC_CR_NCS4) BCH ECC Enable Position */
#define HEMC_CR_NCS4_ECC12_ENABLE_Msk         (_U_(0x1) << HEMC_CR_NCS4_ECC12_ENABLE_Pos)          /**< (HEMC_CR_NCS4) BCH ECC Enable Mask */
#define HEMC_CR_NCS4_ECC12_ENABLE(value)      (HEMC_CR_NCS4_ECC12_ENABLE_Msk & ((value) << HEMC_CR_NCS4_ECC12_ENABLE_Pos))
#define HEMC_CR_NCS4_Msk                      _U_(0xC1FFFFFF)                                      /**< (HEMC_CR_NCS4) Register Mask  */


/* -------- HEMC_CR_NCS5 : (HEMC Offset: 0x14) (R/W 32) HEMC Control Register NCS 5 -------- */
#define HEMC_CR_NCS5_ZERO_Pos                 _U_(0)                                               /**< (HEMC_CR_NCS5) fixed to 0 Position */
#define HEMC_CR_NCS5_ZERO_Msk                 (_U_(0x1) << HEMC_CR_NCS5_ZERO_Pos)                  /**< (HEMC_CR_NCS5) fixed to 0 Mask */
#define HEMC_CR_NCS5_ZERO(value)              (HEMC_CR_NCS5_ZERO_Msk & ((value) << HEMC_CR_NCS5_ZERO_Pos))
#define HEMC_CR_NCS5_BANKSIZE_Pos             _U_(1)                                               /**< (HEMC_CR_NCS5) Bank Size Position */
#define HEMC_CR_NCS5_BANKSIZE_Msk             (_U_(0x1F) << HEMC_CR_NCS5_BANKSIZE_Pos)             /**< (HEMC_CR_NCS5) Bank Size Mask */
#define HEMC_CR_NCS5_BANKSIZE(value)          (HEMC_CR_NCS5_BANKSIZE_Msk & ((value) << HEMC_CR_NCS5_BANKSIZE_Pos))
#define   HEMC_CR_NCS5_BANKSIZE_8KB_Val       _U_(0x0)                                             /**< (HEMC_CR_NCS5) 8Kbytes  */
#define   HEMC_CR_NCS5_BANKSIZE_16KB_Val      _U_(0x1)                                             /**< (HEMC_CR_NCS5) 16Kbytes  */
#define   HEMC_CR_NCS5_BANKSIZE_32KB_Val      _U_(0x2)                                             /**< (HEMC_CR_NCS5) 32Kbytes  */
#define   HEMC_CR_NCS5_BANKSIZE_64KB_Val      _U_(0x3)                                             /**< (HEMC_CR_NCS5) 64Kbytes  */
#define   HEMC_CR_NCS5_BANKSIZE_128KB_Val     _U_(0x4)                                             /**< (HEMC_CR_NCS5) 128Kbytes  */
#define   HEMC_CR_NCS5_BANKSIZE_256KB_Val     _U_(0x5)                                             /**< (HEMC_CR_NCS5) 256Kbytes  */
#define   HEMC_CR_NCS5_BANKSIZE_512KB_Val     _U_(0x6)                                             /**< (HEMC_CR_NCS5) 512Kbytes  */
#define   HEMC_CR_NCS5_BANKSIZE_1MB_Val       _U_(0x7)                                             /**< (HEMC_CR_NCS5) 1Mbytes  */
#define   HEMC_CR_NCS5_BANKSIZE_2MB_Val       _U_(0x8)                                             /**< (HEMC_CR_NCS5) 2Mbytes  */
#define   HEMC_CR_NCS5_BANKSIZE_4MB_Val       _U_(0x9)                                             /**< (HEMC_CR_NCS5) 4Mbytes  */
#define   HEMC_CR_NCS5_BANKSIZE_8MB_Val       _U_(0xA)                                             /**< (HEMC_CR_NCS5) 8Mbytes  */
#define   HEMC_CR_NCS5_BANKSIZE_16MB_Val      _U_(0xB)                                             /**< (HEMC_CR_NCS5) 16Mbytes  */
#define   HEMC_CR_NCS5_BANKSIZE_32MB_Val      _U_(0xC)                                             /**< (HEMC_CR_NCS5) 32Mbytes  */
#define   HEMC_CR_NCS5_BANKSIZE_64MB_Val      _U_(0xD)                                             /**< (HEMC_CR_NCS5) 64Mbytes  */
#define   HEMC_CR_NCS5_BANKSIZE_128MB_Val     _U_(0xE)                                             /**< (HEMC_CR_NCS5) 128Mbytes  */
#define   HEMC_CR_NCS5_BANKSIZE_256MB_Val     _U_(0xF)                                             /**< (HEMC_CR_NCS5) 256Mbytes (Default)  */
#define   HEMC_CR_NCS5_BANKSIZE_512MB_Val     _U_(0x10)                                            /**< (HEMC_CR_NCS5) 512Mbytes  */
#define   HEMC_CR_NCS5_BANKSIZE_NOT_USED_Val  _U_(0x1F)                                            /**< (HEMC_CR_NCS5) NOT_USED  */
#define HEMC_CR_NCS5_BANKSIZE_8KB             (HEMC_CR_NCS5_BANKSIZE_8KB_Val << HEMC_CR_NCS5_BANKSIZE_Pos) /**< (HEMC_CR_NCS5) 8Kbytes Position  */
#define HEMC_CR_NCS5_BANKSIZE_16KB            (HEMC_CR_NCS5_BANKSIZE_16KB_Val << HEMC_CR_NCS5_BANKSIZE_Pos) /**< (HEMC_CR_NCS5) 16Kbytes Position  */
#define HEMC_CR_NCS5_BANKSIZE_32KB            (HEMC_CR_NCS5_BANKSIZE_32KB_Val << HEMC_CR_NCS5_BANKSIZE_Pos) /**< (HEMC_CR_NCS5) 32Kbytes Position  */
#define HEMC_CR_NCS5_BANKSIZE_64KB            (HEMC_CR_NCS5_BANKSIZE_64KB_Val << HEMC_CR_NCS5_BANKSIZE_Pos) /**< (HEMC_CR_NCS5) 64Kbytes Position  */
#define HEMC_CR_NCS5_BANKSIZE_128KB           (HEMC_CR_NCS5_BANKSIZE_128KB_Val << HEMC_CR_NCS5_BANKSIZE_Pos) /**< (HEMC_CR_NCS5) 128Kbytes Position  */
#define HEMC_CR_NCS5_BANKSIZE_256KB           (HEMC_CR_NCS5_BANKSIZE_256KB_Val << HEMC_CR_NCS5_BANKSIZE_Pos) /**< (HEMC_CR_NCS5) 256Kbytes Position  */
#define HEMC_CR_NCS5_BANKSIZE_512KB           (HEMC_CR_NCS5_BANKSIZE_512KB_Val << HEMC_CR_NCS5_BANKSIZE_Pos) /**< (HEMC_CR_NCS5) 512Kbytes Position  */
#define HEMC_CR_NCS5_BANKSIZE_1MB             (HEMC_CR_NCS5_BANKSIZE_1MB_Val << HEMC_CR_NCS5_BANKSIZE_Pos) /**< (HEMC_CR_NCS5) 1Mbytes Position  */
#define HEMC_CR_NCS5_BANKSIZE_2MB             (HEMC_CR_NCS5_BANKSIZE_2MB_Val << HEMC_CR_NCS5_BANKSIZE_Pos) /**< (HEMC_CR_NCS5) 2Mbytes Position  */
#define HEMC_CR_NCS5_BANKSIZE_4MB             (HEMC_CR_NCS5_BANKSIZE_4MB_Val << HEMC_CR_NCS5_BANKSIZE_Pos) /**< (HEMC_CR_NCS5) 4Mbytes Position  */
#define HEMC_CR_NCS5_BANKSIZE_8MB             (HEMC_CR_NCS5_BANKSIZE_8MB_Val << HEMC_CR_NCS5_BANKSIZE_Pos) /**< (HEMC_CR_NCS5) 8Mbytes Position  */
#define HEMC_CR_NCS5_BANKSIZE_16MB            (HEMC_CR_NCS5_BANKSIZE_16MB_Val << HEMC_CR_NCS5_BANKSIZE_Pos) /**< (HEMC_CR_NCS5) 16Mbytes Position  */
#define HEMC_CR_NCS5_BANKSIZE_32MB            (HEMC_CR_NCS5_BANKSIZE_32MB_Val << HEMC_CR_NCS5_BANKSIZE_Pos) /**< (HEMC_CR_NCS5) 32Mbytes Position  */
#define HEMC_CR_NCS5_BANKSIZE_64MB            (HEMC_CR_NCS5_BANKSIZE_64MB_Val << HEMC_CR_NCS5_BANKSIZE_Pos) /**< (HEMC_CR_NCS5) 64Mbytes Position  */
#define HEMC_CR_NCS5_BANKSIZE_128MB           (HEMC_CR_NCS5_BANKSIZE_128MB_Val << HEMC_CR_NCS5_BANKSIZE_Pos) /**< (HEMC_CR_NCS5) 128Mbytes Position  */
#define HEMC_CR_NCS5_BANKSIZE_256MB           (HEMC_CR_NCS5_BANKSIZE_256MB_Val << HEMC_CR_NCS5_BANKSIZE_Pos) /**< (HEMC_CR_NCS5) 256Mbytes (Default) Position  */
#define HEMC_CR_NCS5_BANKSIZE_512MB           (HEMC_CR_NCS5_BANKSIZE_512MB_Val << HEMC_CR_NCS5_BANKSIZE_Pos) /**< (HEMC_CR_NCS5) 512Mbytes Position  */
#define HEMC_CR_NCS5_BANKSIZE_NOT_USED        (HEMC_CR_NCS5_BANKSIZE_NOT_USED_Val << HEMC_CR_NCS5_BANKSIZE_Pos) /**< (HEMC_CR_NCS5) NOT_USED Position  */
#define HEMC_CR_NCS5_TYPE_Pos                 _U_(6)                                               /**< (HEMC_CR_NCS5) type of memory used Position */
#define HEMC_CR_NCS5_TYPE_Msk                 (_U_(0x1) << HEMC_CR_NCS5_TYPE_Pos)                  /**< (HEMC_CR_NCS5) type of memory used Mask */
#define HEMC_CR_NCS5_TYPE(value)              (HEMC_CR_NCS5_TYPE_Msk & ((value) << HEMC_CR_NCS5_TYPE_Pos))
#define HEMC_CR_NCS5_ADDBASE_Pos              _U_(7)                                               /**< (HEMC_CR_NCS5) relative base address of NCS area Position */
#define HEMC_CR_NCS5_ADDBASE_Msk              (_U_(0x3FFFF) << HEMC_CR_NCS5_ADDBASE_Pos)           /**< (HEMC_CR_NCS5) relative base address of NCS area Mask */
#define HEMC_CR_NCS5_ADDBASE(value)           (HEMC_CR_NCS5_ADDBASE_Msk & ((value) << HEMC_CR_NCS5_ADDBASE_Pos))
#define HEMC_CR_NCS5_ECC_ENABLE_Pos           _U_(30)                                              /**< (HEMC_CR_NCS5) ECC Protection Enable Position */
#define HEMC_CR_NCS5_ECC_ENABLE_Msk           (_U_(0x1) << HEMC_CR_NCS5_ECC_ENABLE_Pos)            /**< (HEMC_CR_NCS5) ECC Protection Enable Mask */
#define HEMC_CR_NCS5_ECC_ENABLE(value)        (HEMC_CR_NCS5_ECC_ENABLE_Msk & ((value) << HEMC_CR_NCS5_ECC_ENABLE_Pos))
#define HEMC_CR_NCS5_ECC12_ENABLE_Pos         _U_(31)                                              /**< (HEMC_CR_NCS5) BCH ECC Enable Position */
#define HEMC_CR_NCS5_ECC12_ENABLE_Msk         (_U_(0x1) << HEMC_CR_NCS5_ECC12_ENABLE_Pos)          /**< (HEMC_CR_NCS5) BCH ECC Enable Mask */
#define HEMC_CR_NCS5_ECC12_ENABLE(value)      (HEMC_CR_NCS5_ECC12_ENABLE_Msk & ((value) << HEMC_CR_NCS5_ECC12_ENABLE_Pos))
#define HEMC_CR_NCS5_Msk                      _U_(0xC1FFFFFF)                                      /**< (HEMC_CR_NCS5) Register Mask  */


