Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/hemc.h
/* -------- HEMC_IMR : (HEMC Offset: 0x40) ( R/ 32) HEMC Interrupt Mask Register -------- */
#define HEMC_IMR_OUTOFRANGE_Pos               _U_(1)                                               /**< (HEMC_IMR) out of range Position */
#define HEMC_IMR_OUTOFRANGE_Msk               (_U_(0x1) << HEMC_IMR_OUTOFRANGE_Pos)                /**< (HEMC_IMR) out of range Mask */
#define HEMC_IMR_OUTOFRANGE(value)            (HEMC_IMR_OUTOFRANGE_Msk & ((value) << HEMC_IMR_OUTOFRANGE_Pos))
#define HEMC_IMR_RDERRORACCESS_Pos            _U_(2)                                               /**< (HEMC_IMR) read access error Position */
#define HEMC_IMR_RDERRORACCESS_Msk            (_U_(0x1) << HEMC_IMR_RDERRORACCESS_Pos)             /**< (HEMC_IMR) read access error Mask */
#define HEMC_IMR_RDERRORACCESS(value)         (HEMC_IMR_RDERRORACCESS_Msk & ((value) << HEMC_IMR_RDERRORACCESS_Pos))
#define HEMC_IMR_WRERRORACCESS_Pos            _U_(3)                                               /**< (HEMC_IMR) write access error Position */
#define HEMC_IMR_WRERRORACCESS_Msk            (_U_(0x1) << HEMC_IMR_WRERRORACCESS_Pos)             /**< (HEMC_IMR) write access error Mask */
#define HEMC_IMR_WRERRORACCESS(value)         (HEMC_IMR_WRERRORACCESS_Msk & ((value) << HEMC_IMR_WRERRORACCESS_Pos))
#define HEMC_IMR_USERERRORACCESS_Pos          _U_(4)                                               /**< (HEMC_IMR) user or superuser access error Position */
#define HEMC_IMR_USERERRORACCESS_Msk          (_U_(0x1) << HEMC_IMR_USERERRORACCESS_Pos)           /**< (HEMC_IMR) user or superuser access error Mask */
#define HEMC_IMR_USERERRORACCESS(value)       (HEMC_IMR_USERERRORACCESS_Msk & ((value) << HEMC_IMR_USERERRORACCESS_Pos))
#define HEMC_IMR_Msk                          _U_(0x0000001E)                                      /**< (HEMC_IMR) Register Mask  */


/* -------- HEMC_ISR : (HEMC Offset: 0x44) ( R/ 32) HEMC Interrupt Status Register -------- */
#define HEMC_ISR_OUTOFRANGE_Pos               _U_(1)                                               /**< (HEMC_ISR) out of range Position */
#define HEMC_ISR_OUTOFRANGE_Msk               (_U_(0x1) << HEMC_ISR_OUTOFRANGE_Pos)                /**< (HEMC_ISR) out of range Mask */
#define HEMC_ISR_OUTOFRANGE(value)            (HEMC_ISR_OUTOFRANGE_Msk & ((value) << HEMC_ISR_OUTOFRANGE_Pos))
#define HEMC_ISR_RDERRORACCESS_Pos            _U_(2)                                               /**< (HEMC_ISR) read access error Position */
#define HEMC_ISR_RDERRORACCESS_Msk            (_U_(0x1) << HEMC_ISR_RDERRORACCESS_Pos)             /**< (HEMC_ISR) read access error Mask */
#define HEMC_ISR_RDERRORACCESS(value)         (HEMC_ISR_RDERRORACCESS_Msk & ((value) << HEMC_ISR_RDERRORACCESS_Pos))
#define HEMC_ISR_WRERRORACCESS_Pos            _U_(3)                                               /**< (HEMC_ISR) Write access error Position */
#define HEMC_ISR_WRERRORACCESS_Msk            (_U_(0x1) << HEMC_ISR_WRERRORACCESS_Pos)             /**< (HEMC_ISR) Write access error Mask */
#define HEMC_ISR_WRERRORACCESS(value)         (HEMC_ISR_WRERRORACCESS_Msk & ((value) << HEMC_ISR_WRERRORACCESS_Pos))
#define HEMC_ISR_USERERRORACCESS_Pos          _U_(4)                                               /**< (HEMC_ISR) User or SuperUser Error Access Position */
#define HEMC_ISR_USERERRORACCESS_Msk          (_U_(0x1) << HEMC_ISR_USERERRORACCESS_Pos)           /**< (HEMC_ISR) User or SuperUser Error Access Mask */
#define HEMC_ISR_USERERRORACCESS(value)       (HEMC_ISR_USERERRORACCESS_Msk & ((value) << HEMC_ISR_USERERRORACCESS_Pos))
#define HEMC_ISR_Msk                          _U_(0x0000001E)                                      /**< (HEMC_ISR) Register Mask  */


/* -------- HEMC_SR : (HEMC Offset: 0x48) ( R/ 32) HEMC Status Register -------- */
#define HEMC_SR_OUTOFRANGE_Pos                _U_(1)                                               /**< (HEMC_SR) out of range Position */
#define HEMC_SR_OUTOFRANGE_Msk                (_U_(0x1) << HEMC_SR_OUTOFRANGE_Pos)                 /**< (HEMC_SR) out of range Mask */
#define HEMC_SR_OUTOFRANGE(value)             (HEMC_SR_OUTOFRANGE_Msk & ((value) << HEMC_SR_OUTOFRANGE_Pos))
#define HEMC_SR_RDERRORACCESS_Pos             _U_(2)                                               /**< (HEMC_SR) Read access error Position */
#define HEMC_SR_RDERRORACCESS_Msk             (_U_(0x1) << HEMC_SR_RDERRORACCESS_Pos)              /**< (HEMC_SR) Read access error Mask */
#define HEMC_SR_RDERRORACCESS(value)          (HEMC_SR_RDERRORACCESS_Msk & ((value) << HEMC_SR_RDERRORACCESS_Pos))
#define HEMC_SR_WRERRORACCESS_Pos             _U_(3)                                               /**< (HEMC_SR) Write access error Position */
#define HEMC_SR_WRERRORACCESS_Msk             (_U_(0x1) << HEMC_SR_WRERRORACCESS_Pos)              /**< (HEMC_SR) Write access error Mask */
#define HEMC_SR_WRERRORACCESS(value)          (HEMC_SR_WRERRORACCESS_Msk & ((value) << HEMC_SR_WRERRORACCESS_Pos))
#define HEMC_SR_USERERRORACCESS_Pos           _U_(4)                                               /**< (HEMC_SR) User or SuperUser Error Access Position */
#define HEMC_SR_USERERRORACCESS_Msk           (_U_(0x1) << HEMC_SR_USERERRORACCESS_Pos)            /**< (HEMC_SR) User or SuperUser Error Access Mask */
#define HEMC_SR_USERERRORACCESS(value)        (HEMC_SR_USERERRORACCESS_Msk & ((value) << HEMC_SR_USERERRORACCESS_Pos))
#define HEMC_SR_Msk                           _U_(0x0000001E)                                      /**< (HEMC_SR) Register Mask  */


/* -------- HEMC_HECC_CR0 : (HEMC Offset: 0x100) (R/W 32) HECC Control Register Channel 0 (HSMC) -------- */
#define HEMC_HECC_CR0_ENABLE_Pos              _U_(0)                                               /**< (HEMC_HECC_CR0) ECC protection enable Position */
#define HEMC_HECC_CR0_ENABLE_Msk              (_U_(0x1) << HEMC_HECC_CR0_ENABLE_Pos)               /**< (HEMC_HECC_CR0) ECC protection enable Mask */
#define HEMC_HECC_CR0_ENABLE(value)           (HEMC_HECC_CR0_ENABLE_Msk & ((value) << HEMC_HECC_CR0_ENABLE_Pos))
#define HEMC_HECC_CR0_TEST_MODE_RD_Pos        _U_(1)                                               /**< (HEMC_HECC_CR0) test mode of ECC protection - read mode Position */
#define HEMC_HECC_CR0_TEST_MODE_RD_Msk        (_U_(0x1) << HEMC_HECC_CR0_TEST_MODE_RD_Pos)         /**< (HEMC_HECC_CR0) test mode of ECC protection - read mode Mask */
#define HEMC_HECC_CR0_TEST_MODE_RD(value)     (HEMC_HECC_CR0_TEST_MODE_RD_Msk & ((value) << HEMC_HECC_CR0_TEST_MODE_RD_Pos))
#define HEMC_HECC_CR0_TEST_MODE_WR_Pos        _U_(2)                                               /**< (HEMC_HECC_CR0) test mode of ECC protection - write mode Position */
#define HEMC_HECC_CR0_TEST_MODE_WR_Msk        (_U_(0x1) << HEMC_HECC_CR0_TEST_MODE_WR_Pos)         /**< (HEMC_HECC_CR0) test mode of ECC protection - write mode Mask */
#define HEMC_HECC_CR0_TEST_MODE_WR(value)     (HEMC_HECC_CR0_TEST_MODE_WR_Msk & ((value) << HEMC_HECC_CR0_TEST_MODE_WR_Pos))
#define HEMC_HECC_CR0_RST_FIX_CPT_Pos         _U_(4)                                               /**< (HEMC_HECC_CR0) reset the fixable error counter Position */
#define HEMC_HECC_CR0_RST_FIX_CPT_Msk         (_U_(0x1) << HEMC_HECC_CR0_RST_FIX_CPT_Pos)          /**< (HEMC_HECC_CR0) reset the fixable error counter Mask */
#define HEMC_HECC_CR0_RST_FIX_CPT(value)      (HEMC_HECC_CR0_RST_FIX_CPT_Msk & ((value) << HEMC_HECC_CR0_RST_FIX_CPT_Pos))
#define HEMC_HECC_CR0_RST_NOFIX_CPT_Pos       _U_(5)                                               /**< (HEMC_HECC_CR0) reset the un-fixable error counter Position */
#define HEMC_HECC_CR0_RST_NOFIX_CPT_Msk       (_U_(0x1) << HEMC_HECC_CR0_RST_NOFIX_CPT_Pos)        /**< (HEMC_HECC_CR0) reset the un-fixable error counter Mask */
#define HEMC_HECC_CR0_RST_NOFIX_CPT(value)    (HEMC_HECC_CR0_RST_NOFIX_CPT_Msk & ((value) << HEMC_HECC_CR0_RST_NOFIX_CPT_Pos))
#define HEMC_HECC_CR0_ECC12_ENABLE_Pos        _U_(6)                                               /**< (HEMC_HECC_CR0) BCH ECC enable Position */
#define HEMC_HECC_CR0_ECC12_ENABLE_Msk        (_U_(0x1) << HEMC_HECC_CR0_ECC12_ENABLE_Pos)         /**< (HEMC_HECC_CR0) BCH ECC enable Mask */
#define HEMC_HECC_CR0_ECC12_ENABLE(value)     (HEMC_HECC_CR0_ECC12_ENABLE_Msk & ((value) << HEMC_HECC_CR0_ECC12_ENABLE_Pos))
#define HEMC_HECC_CR0_Msk                     _U_(0x00000077)                                      /**< (HEMC_HECC_CR0) Register Mask  */


/* -------- HEMC_HECC_CR1 : (HEMC Offset: 0x104) (R/W 32) HECC Control Register Channel 1 (HSDRAMC) -------- */
#define HEMC_HECC_CR1_ENABLE_Pos              _U_(0)                                               /**< (HEMC_HECC_CR1) ECC protection enable Position */
#define HEMC_HECC_CR1_ENABLE_Msk              (_U_(0x1) << HEMC_HECC_CR1_ENABLE_Pos)               /**< (HEMC_HECC_CR1) ECC protection enable Mask */
#define HEMC_HECC_CR1_ENABLE(value)           (HEMC_HECC_CR1_ENABLE_Msk & ((value) << HEMC_HECC_CR1_ENABLE_Pos))
#define HEMC_HECC_CR1_TEST_MODE_RD_Pos        _U_(1)                                               /**< (HEMC_HECC_CR1) test mode of ECC protection - read mode Position */
#define HEMC_HECC_CR1_TEST_MODE_RD_Msk        (_U_(0x1) << HEMC_HECC_CR1_TEST_MODE_RD_Pos)         /**< (HEMC_HECC_CR1) test mode of ECC protection - read mode Mask */
#define HEMC_HECC_CR1_TEST_MODE_RD(value)     (HEMC_HECC_CR1_TEST_MODE_RD_Msk & ((value) << HEMC_HECC_CR1_TEST_MODE_RD_Pos))
#define HEMC_HECC_CR1_TEST_MODE_WR_Pos        _U_(2)                                               /**< (HEMC_HECC_CR1) test mode of ECC protection - write mode Position */
#define HEMC_HECC_CR1_TEST_MODE_WR_Msk        (_U_(0x1) << HEMC_HECC_CR1_TEST_MODE_WR_Pos)         /**< (HEMC_HECC_CR1) test mode of ECC protection - write mode Mask */
#define HEMC_HECC_CR1_TEST_MODE_WR(value)     (HEMC_HECC_CR1_TEST_MODE_WR_Msk & ((value) << HEMC_HECC_CR1_TEST_MODE_WR_Pos))
#define HEMC_HECC_CR1_RST_FIX_CPT_Pos         _U_(4)                                               /**< (HEMC_HECC_CR1) reset the fixable error counter Position */
#define HEMC_HECC_CR1_RST_FIX_CPT_Msk         (_U_(0x1) << HEMC_HECC_CR1_RST_FIX_CPT_Pos)          /**< (HEMC_HECC_CR1) reset the fixable error counter Mask */
#define HEMC_HECC_CR1_RST_FIX_CPT(value)      (HEMC_HECC_CR1_RST_FIX_CPT_Msk & ((value) << HEMC_HECC_CR1_RST_FIX_CPT_Pos))
#define HEMC_HECC_CR1_RST_NOFIX_CPT_Pos       _U_(5)                                               /**< (HEMC_HECC_CR1) reset the un-fixable error counter Position */
#define HEMC_HECC_CR1_RST_NOFIX_CPT_Msk       (_U_(0x1) << HEMC_HECC_CR1_RST_NOFIX_CPT_Pos)        /**< (HEMC_HECC_CR1) reset the un-fixable error counter Mask */
#define HEMC_HECC_CR1_RST_NOFIX_CPT(value)    (HEMC_HECC_CR1_RST_NOFIX_CPT_Msk & ((value) << HEMC_HECC_CR1_RST_NOFIX_CPT_Pos))
#define HEMC_HECC_CR1_ECC12_ENABLE_Pos        _U_(6)                                               /**< (HEMC_HECC_CR1) BCH ECC enable Position */
#define HEMC_HECC_CR1_ECC12_ENABLE_Msk        (_U_(0x1) << HEMC_HECC_CR1_ECC12_ENABLE_Pos)         /**< (HEMC_HECC_CR1) BCH ECC enable Mask */
#define HEMC_HECC_CR1_ECC12_ENABLE(value)     (HEMC_HECC_CR1_ECC12_ENABLE_Msk & ((value) << HEMC_HECC_CR1_ECC12_ENABLE_Pos))
#define HEMC_HECC_CR1_Msk                     _U_(0x00000077)                                      /**< (HEMC_HECC_CR1) Register Mask  */


/* -------- HEMC_HECC_CR2 : (HEMC Offset: 0x108) (R/W 32) HECC Control Register Channel 2 (HSDRAMC) -------- */
#define HEMC_HECC_CR2_ENABLE_Pos              _U_(0)                                               /**< (HEMC_HECC_CR2) ECC protection enable Position */
#define HEMC_HECC_CR2_ENABLE_Msk              (_U_(0x1) << HEMC_HECC_CR2_ENABLE_Pos)               /**< (HEMC_HECC_CR2) ECC protection enable Mask */
#define HEMC_HECC_CR2_ENABLE(value)           (HEMC_HECC_CR2_ENABLE_Msk & ((value) << HEMC_HECC_CR2_ENABLE_Pos))
#define HEMC_HECC_CR2_TEST_MODE_RD_Pos        _U_(1)                                               /**< (HEMC_HECC_CR2) test mode of ECC protection - read mode Position */
#define HEMC_HECC_CR2_TEST_MODE_RD_Msk        (_U_(0x1) << HEMC_HECC_CR2_TEST_MODE_RD_Pos)         /**< (HEMC_HECC_CR2) test mode of ECC protection - read mode Mask */
#define HEMC_HECC_CR2_TEST_MODE_RD(value)     (HEMC_HECC_CR2_TEST_MODE_RD_Msk & ((value) << HEMC_HECC_CR2_TEST_MODE_RD_Pos))
#define HEMC_HECC_CR2_TEST_MODE_WR_Pos        _U_(2)                                               /**< (HEMC_HECC_CR2) test mode of ECC protection - write mode Position */
#define HEMC_HECC_CR2_TEST_MODE_WR_Msk        (_U_(0x1) << HEMC_HECC_CR2_TEST_MODE_WR_Pos)         /**< (HEMC_HECC_CR2) test mode of ECC protection - write mode Mask */
#define HEMC_HECC_CR2_TEST_MODE_WR(value)     (HEMC_HECC_CR2_TEST_MODE_WR_Msk & ((value) << HEMC_HECC_CR2_TEST_MODE_WR_Pos))
#define HEMC_HECC_CR2_RST_FIX_CPT_Pos         _U_(4)                                               /**< (HEMC_HECC_CR2) reset the fixable error counter Position */
#define HEMC_HECC_CR2_RST_FIX_CPT_Msk         (_U_(0x1) << HEMC_HECC_CR2_RST_FIX_CPT_Pos)          /**< (HEMC_HECC_CR2) reset the fixable error counter Mask */
#define HEMC_HECC_CR2_RST_FIX_CPT(value)      (HEMC_HECC_CR2_RST_FIX_CPT_Msk & ((value) << HEMC_HECC_CR2_RST_FIX_CPT_Pos))
#define HEMC_HECC_CR2_RST_NOFIX_CPT_Pos       _U_(5)                                               /**< (HEMC_HECC_CR2) reset the un-fixable error counter Position */
#define HEMC_HECC_CR2_RST_NOFIX_CPT_Msk       (_U_(0x1) << HEMC_HECC_CR2_RST_NOFIX_CPT_Pos)        /**< (HEMC_HECC_CR2) reset the un-fixable error counter Mask */
#define HEMC_HECC_CR2_RST_NOFIX_CPT(value)    (HEMC_HECC_CR2_RST_NOFIX_CPT_Msk & ((value) << HEMC_HECC_CR2_RST_NOFIX_CPT_Pos))
#define HEMC_HECC_CR2_ECC12_ENABLE_Pos        _U_(6)                                               /**< (HEMC_HECC_CR2) BCH ECC enable Position */
#define HEMC_HECC_CR2_ECC12_ENABLE_Msk        (_U_(0x1) << HEMC_HECC_CR2_ECC12_ENABLE_Pos)         /**< (HEMC_HECC_CR2) BCH ECC enable Mask */
#define HEMC_HECC_CR2_ECC12_ENABLE(value)     (HEMC_HECC_CR2_ECC12_ENABLE_Msk & ((value) << HEMC_HECC_CR2_ECC12_ENABLE_Pos))
#define HEMC_HECC_CR2_Msk                     _U_(0x00000077)                                      /**< (HEMC_HECC_CR2) Register Mask  */


/* -------- HEMC_HECC_TESTCB0 : (HEMC Offset: 0x140) (R/W 32) HECC Test mode Register Channel 0 (HSMC) -------- */
#define HEMC_HECC_TESTCB0_TCB1_Pos            _U_(0)                                               /**< (HEMC_HECC_TESTCB0) test check bit (16 bit) Position */
#define HEMC_HECC_TESTCB0_TCB1_Msk            (_U_(0xFFFF) << HEMC_HECC_TESTCB0_TCB1_Pos)          /**< (HEMC_HECC_TESTCB0) test check bit (16 bit) Mask */
#define HEMC_HECC_TESTCB0_TCB1(value)         (HEMC_HECC_TESTCB0_TCB1_Msk & ((value) << HEMC_HECC_TESTCB0_TCB1_Pos))
#define HEMC_HECC_TESTCB0_Msk                 _U_(0x0000FFFF)                                      /**< (HEMC_HECC_TESTCB0) Register Mask  */


/* -------- HEMC_HECC_TESTCB1 : (HEMC Offset: 0x144) (R/W 32) HECC Test mode Register Channel 1 (HSDRAMC) -------- */
#define HEMC_HECC_TESTCB1_TCB1_Pos            _U_(0)                                               /**< (HEMC_HECC_TESTCB1) test check bit (16 bit) Position */
#define HEMC_HECC_TESTCB1_TCB1_Msk            (_U_(0xFFFF) << HEMC_HECC_TESTCB1_TCB1_Pos)          /**< (HEMC_HECC_TESTCB1) test check bit (16 bit) Mask */
#define HEMC_HECC_TESTCB1_TCB1(value)         (HEMC_HECC_TESTCB1_TCB1_Msk & ((value) << HEMC_HECC_TESTCB1_TCB1_Pos))
#define HEMC_HECC_TESTCB1_Msk                 _U_(0x0000FFFF)                                      /**< (HEMC_HECC_TESTCB1) Register Mask  */


/* -------- HEMC_HECC_TESTCB2 : (HEMC Offset: 0x148) (R/W 32) HECC Test mode Register Channel 2 (HSDRAMC) -------- */
#define HEMC_HECC_TESTCB2_TCB1_Pos            _U_(0)                                               /**< (HEMC_HECC_TESTCB2) test check bit (16 bit) Position */
#define HEMC_HECC_TESTCB2_TCB1_Msk            (_U_(0xFFFF) << HEMC_HECC_TESTCB2_TCB1_Pos)          /**< (HEMC_HECC_TESTCB2) test check bit (16 bit) Mask */
#define HEMC_HECC_TESTCB2_TCB1(value)         (HEMC_HECC_TESTCB2_TCB1_Msk & ((value) << HEMC_HECC_TESTCB2_TCB1_Pos))
#define HEMC_HECC_TESTCB2_Msk                 _U_(0x0000FFFF)                                      /**< (HEMC_HECC_TESTCB2) Register Mask  */


/* -------- HEMC_HECC_SR : (HEMC Offset: 0x180) ( R/ 32) HECC Status Register -------- */
#define HEMC_HECC_SR_MEM_FIX_Pos              _U_(0)                                               /**< (HEMC_HECC_SR) Fixable error status Position */
#define HEMC_HECC_SR_MEM_FIX_Msk              (_U_(0x1) << HEMC_HECC_SR_MEM_FIX_Pos)               /**< (HEMC_HECC_SR) Fixable error status Mask */
#define HEMC_HECC_SR_MEM_FIX(value)           (HEMC_HECC_SR_MEM_FIX_Msk & ((value) << HEMC_HECC_SR_MEM_FIX_Pos))
#define HEMC_HECC_SR_CPT_FIX_Pos              _U_(2)                                               /**< (HEMC_HECC_SR) 5 bits counter Position */
#define HEMC_HECC_SR_CPT_FIX_Msk              (_U_(0x1F) << HEMC_HECC_SR_CPT_FIX_Pos)              /**< (HEMC_HECC_SR) 5 bits counter Mask */
#define HEMC_HECC_SR_CPT_FIX(value)           (HEMC_HECC_SR_CPT_FIX_Msk & ((value) << HEMC_HECC_SR_CPT_FIX_Pos))
#define HEMC_HECC_SR_OVER_FIX_Pos             _U_(7)                                               /**< (HEMC_HECC_SR) counter overflow Position */
#define HEMC_HECC_SR_OVER_FIX_Msk             (_U_(0x1) << HEMC_HECC_SR_OVER_FIX_Pos)              /**< (HEMC_HECC_SR) counter overflow Mask */
#define HEMC_HECC_SR_OVER_FIX(value)          (HEMC_HECC_SR_OVER_FIX_Msk & ((value) << HEMC_HECC_SR_OVER_FIX_Pos))
#define HEMC_HECC_SR_MEM_NOFIX_Pos            _U_(8)                                               /**< (HEMC_HECC_SR) Un-fixable error status Position */
#define HEMC_HECC_SR_MEM_NOFIX_Msk            (_U_(0x1) << HEMC_HECC_SR_MEM_NOFIX_Pos)             /**< (HEMC_HECC_SR) Un-fixable error status Mask */
#define HEMC_HECC_SR_MEM_NOFIX(value)         (HEMC_HECC_SR_MEM_NOFIX_Msk & ((value) << HEMC_HECC_SR_MEM_NOFIX_Pos))
#define HEMC_HECC_SR_CPT_NOFIX_Pos            _U_(10)                                              /**< (HEMC_HECC_SR) 5 bits counter Position */
#define HEMC_HECC_SR_CPT_NOFIX_Msk            (_U_(0x1F) << HEMC_HECC_SR_CPT_NOFIX_Pos)            /**< (HEMC_HECC_SR) 5 bits counter Mask */
#define HEMC_HECC_SR_CPT_NOFIX(value)         (HEMC_HECC_SR_CPT_NOFIX_Msk & ((value) << HEMC_HECC_SR_CPT_NOFIX_Pos))
#define HEMC_HECC_SR_OVER_NOFIX_Pos           _U_(15)                                              /**< (HEMC_HECC_SR) counter overflow Position */
#define HEMC_HECC_SR_OVER_NOFIX_Msk           (_U_(0x1) << HEMC_HECC_SR_OVER_NOFIX_Pos)            /**< (HEMC_HECC_SR) counter overflow Mask */
#define HEMC_HECC_SR_OVER_NOFIX(value)        (HEMC_HECC_SR_OVER_NOFIX_Msk & ((value) << HEMC_HECC_SR_OVER_NOFIX_Pos))
#define HEMC_HECC_SR_HES_Pos                  _U_(24)                                              /**< (HEMC_HECC_SR) Hardware Error Size Position */
#define HEMC_HECC_SR_HES_Msk                  (_U_(0x7) << HEMC_HECC_SR_HES_Pos)                   /**< (HEMC_HECC_SR) Hardware Error Size Mask */
#define HEMC_HECC_SR_HES(value)               (HEMC_HECC_SR_HES_Msk & ((value) << HEMC_HECC_SR_HES_Pos))
#define HEMC_HECC_SR_TYPE_Pos                 _U_(27)                                              /**< (HEMC_HECC_SR) write or read access Position */
#define HEMC_HECC_SR_TYPE_Msk                 (_U_(0x1) << HEMC_HECC_SR_TYPE_Pos)                  /**< (HEMC_HECC_SR) write or read access Mask */
#define HEMC_HECC_SR_TYPE(value)              (HEMC_HECC_SR_TYPE_Msk & ((value) << HEMC_HECC_SR_TYPE_Pos))
#define HEMC_HECC_SR_Msk                      _U_(0x0F00FDFD)                                      /**< (HEMC_HECC_SR) Register Mask  */


/* -------- HEMC_HECC_IER : (HEMC Offset: 0x184) ( /W 32) HECC Interrupt Enable Register -------- */
#define HEMC_HECC_IER_MEM_FIX_Pos             _U_(0)                                               /**< (HEMC_HECC_IER) Fixable error Position */
#define HEMC_HECC_IER_MEM_FIX_Msk             (_U_(0x1) << HEMC_HECC_IER_MEM_FIX_Pos)              /**< (HEMC_HECC_IER) Fixable error Mask */
#define HEMC_HECC_IER_MEM_FIX(value)          (HEMC_HECC_IER_MEM_FIX_Msk & ((value) << HEMC_HECC_IER_MEM_FIX_Pos))
#define HEMC_HECC_IER_MEM_NOFIX_Pos           _U_(1)                                               /**< (HEMC_HECC_IER) Un-fixable error Position */
#define HEMC_HECC_IER_MEM_NOFIX_Msk           (_U_(0x1) << HEMC_HECC_IER_MEM_NOFIX_Pos)            /**< (HEMC_HECC_IER) Un-fixable error Mask */
#define HEMC_HECC_IER_MEM_NOFIX(value)        (HEMC_HECC_IER_MEM_NOFIX_Msk & ((value) << HEMC_HECC_IER_MEM_NOFIX_Pos))
#define HEMC_HECC_IER_Msk                     _U_(0x00000003)                                      /**< (HEMC_HECC_IER) Register Mask  */


