Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/hemc.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief HEMC register API structure */
typedef struct
{
  __IO  uint32_t                       HEMC_CR_NCS0;       /**< Offset: 0x00 (R/W  32) HEMC Control Register NCS 0 */
  __IO  uint32_t                       HEMC_CR_NCS1;       /**< Offset: 0x04 (R/W  32) HEMC Control Register NCS 1 */
  __IO  uint32_t                       HEMC_CR_NCS2;       /**< Offset: 0x08 (R/W  32) HEMC Control Register NCS 2 */
  __IO  uint32_t                       HEMC_CR_NCS3;       /**< Offset: 0x0C (R/W  32) HEMC Control Register NCS 3 */
  __IO  uint32_t                       HEMC_CR_NCS4;       /**< Offset: 0x10 (R/W  32) HEMC Control Register NCS 4 */
  __IO  uint32_t                       HEMC_CR_NCS5;       /**< Offset: 0x14 (R/W  32) HEMC Control Register NCS 5 */
  __IO  uint32_t                       HEMC_CTRL;          /**< Offset: 0x18 (R/W  32) HEMC Polarity Control register */
  __I   uint8_t                        Reserved1[0x04];
  __IO  uint32_t                       HEMC_CRP_NCS0;      /**< Offset: 0x20 (R/W  32) HEMC Control Register Protection NCS 0 */
  __IO  uint32_t                       HEMC_CRP_NCS1;      /**< Offset: 0x24 (R/W  32) HEMC Control Register Protection NCS 1 */
  __IO  uint32_t                       HEMC_CRP_NCS2;      /**< Offset: 0x28 (R/W  32) HEMC Control Register Protection NCS 2 */
  __IO  uint32_t                       HEMC_CRP_NCS3;      /**< Offset: 0x2C (R/W  32) HEMC Control Register Protection NCS 3 */
  __IO  uint32_t                       HEMC_CRP_NCS4;      /**< Offset: 0x30 (R/W  32) HEMC Control Register Protection NCS 4 */
  __IO  uint32_t                       HEMC_CRP_NCS5;      /**< Offset: 0x34 (R/W  32) HEMC Control Register Protection NCS 5 */
  __O   uint32_t                       HEMC_IER;           /**< Offset: 0x38 ( /W  32) HEMC Interrupt Enable Register */
  __O   uint32_t                       HEMC_IDR;           /**< Offset: 0x3C ( /W  32) HEMC Interrupt Disable Register */
  __I   uint32_t                       HEMC_IMR;           /**< Offset: 0x40 (R/   32) HEMC Interrupt Mask Register */
  __I   uint32_t                       HEMC_ISR;           /**< Offset: 0x44 (R/   32) HEMC Interrupt Status Register */
  __I   uint32_t                       HEMC_SR;            /**< Offset: 0x48 (R/   32) HEMC Status Register */
  __I   uint8_t                        Reserved2[0xB4];
  __IO  uint32_t                       HEMC_HECC_CR0;      /**< Offset: 0x100 (R/W  32) HECC Control Register Channel 0 (HSMC) */
  __IO  uint32_t                       HEMC_HECC_CR1;      /**< Offset: 0x104 (R/W  32) HECC Control Register Channel 1 (HSDRAMC) */
  __IO  uint32_t                       HEMC_HECC_CR2;      /**< Offset: 0x108 (R/W  32) HECC Control Register Channel 2 (HSDRAMC) */
  __I   uint8_t                        Reserved3[0x34];
  __IO  uint32_t                       HEMC_HECC_TESTCB0;  /**< Offset: 0x140 (R/W  32) HECC Test mode Register Channel 0 (HSMC) */
  __IO  uint32_t                       HEMC_HECC_TESTCB1;  /**< Offset: 0x144 (R/W  32) HECC Test mode Register Channel 1 (HSDRAMC) */
  __IO  uint32_t                       HEMC_HECC_TESTCB2;  /**< Offset: 0x148 (R/W  32) HECC Test mode Register Channel 2 (HSDRAMC) */
  __I   uint8_t                        Reserved4[0x34];
  __I   uint32_t                       HEMC_HECC_SR;       /**< Offset: 0x180 (R/   32) HECC Status Register */
  __O   uint32_t                       HEMC_HECC_IER;      /**< Offset: 0x184 ( /W  32) HECC Interrupt Enable Register */
  __O   uint32_t                       HEMC_HECC_IDR;      /**< Offset: 0x188 ( /W  32) HECC Interrupt Disable Register */
  __I   uint32_t                       HEMC_HECC_IMR;      /**< Offset: 0x18C (R/   32) HECC Interrupt Mask Register */
  __I   uint32_t                       HEMC_HECC_FAILAR;   /**< Offset: 0x190 (R/   32) HECC Fail address register */
} hemc_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMRH71_HEMC_COMPONENT_H_ */
